lib/tasks/dev.rake

INSERT INTO "kinds" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "Amigo"], ["created_at", "2019-08-29 13:18:10.056679"], ["updated_at", "2019-08-29 13:18:10.056679"]]
INSERT INTO "kinds" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "Amigo"], ["created_at", "2019-08-28 19:57:27.944426"], ["updated_at", "2019-08-28 19:57:27.944426"]]
INSERT INTO "contacts" ("name", "email", "birthdate", "created_at", "updated_at", "kind_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Tiago Araújo"], ["email", "hollis@zboncak.com"], ["birthdate", "1992-10-08"], ["created_at", "2019-08-29 13:18:10.199863"], ["updated_at", "2019-08-29 13:18:10.199863"], ["kind_id", 2]]
SELECT "kinds".* FROM "kinds"
---
  task setup: :environment do
    puts "Zerando o banco de dados..."
    %x(rails db:drop db:create db:migrate)

    puts 'Cadastrando os tipos de contatos...'

    kinds = %w(Amigo Comercial Conhecido)

    kinds.each do |kind|
      Kind.create!(
        description: kind
      )
    end

    puts 'Tipos de contatos cadastrados com sucesso!'

    puts 'Cadastrando os contatos...'

    100.times do
      Contact.create!(
        name: Faker::Name.name,
        email: Faker::Internet.email,
        birthdate: Faker::Date.birthday(min_age: 18, max_age: 65),
        kind: Kind.all.sample
      )

SELECT "contacts".* FROM "contacts"
INSERT INTO "phones" ("number", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["number", "(99) 97947-3821"], ["created_at", "2019-08-29 13:18:10.432672"], ["updated_at", "2019-08-29 13:18:10.432672"]]
UPDATE "phones" SET "contact_id" = $1, "updated_at" = $2 WHERE "phones"."id" = $3  [["contact_id", 1], ["updated_at", "2019-08-29 13:18:10.439862"], ["id", 1]]
---

    puts 'Cadastrando os telefones...'

    Contact.all.each do |contact|
      Random.rand(5).times do |i|
        phone = Phone.create(number: Faker::PhoneNumber.cell_phone )
        contact.phones << phone
        contact.save!

SELECT "contacts".* FROM "contacts"
INSERT INTO "addresses" ("street", "city", "contact_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["street", "2900 Alameda Heitor Casqueira"], ["city", "Entre Rios do Sul"], ["contact_id", 1], ["created_at", "2019-08-29 13:18:26.000344"], ["updated_at", "2019-08-29 13:18:26.000344"]]
---

    puts 'Cadastrando os endereços...'

    Contact.all.each do |contact|
      Address.create(
        street: Faker::Address.street_address,
        city: Faker::Address.city,
        contact: contact
      )