lib/tasks/dev.rake

INSERT INTO "contacts" ("name", "email", "birthdate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Kenneth Huels"], ["email", "kaitlyn@reinger.biz"], ["birthdate", "1959-10-25"], ["created_at", "2019-08-28 15:22:43.021158"], ["updated_at", "2019-08-28 15:22:43.021158"]]
---
  task setup: :environment do

    puts 'Cadastrando os tipos de contatos...'

    kinds = %w(Amigo Comercial Conhecido)

    kinds.each do |kind|
      Kind.create!(
        description: kind
      )
    end

    puts 'Tipos de contatos cadastrados com sucesso!'

    puts 'Cadastrando os contatos...'

    100.times do
      Contact.create!(
        name: Faker::Name.name,
        email: Faker::Internet.email,
        birthdate: Faker::Date.birthday(min_age: 18, max_age: 65),
        kind: Kind.all.sample
      )