app/controllers/v2/contacts_controller.rb

SELECT "contacts".* FROM "contacts"
---
    def index
      @contacts = Contact.all