app/controllers/v2/contacts_controller.rb

    def index
      @contacts = Contact.last(5)
---
SELECT  "contacts".* FROM "contacts" ORDER BY "contacts"."id" DESC LIMIT $1  [["LIMIT", 5]]