app/controllers/v2/phones_controller.rb

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def set_contact
      @contact = Contact.find(params[:contact_id])