app/controllers/v1/contacts_controller.rb

    def index
      page_number = params[:page].try(:[], :number)
      per_page = params[:page].try(:[], :size)
      @contacts = Contact.all.page(page_number).per(per_page)
---
SELECT  "contacts".* FROM "contacts" LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "contacts"

    def create
      @contact = Contact.new(contact_params)

      if @contact.save
---
INSERT INTO "contacts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-09-02 14:28:39.846688"], ["updated_at", "2019-09-02 14:28:39.846688"]]

      def set_contact
        @contact = Contact.find(params[:id])
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]