app/controllers/v1/phones_controller.rb

    def set_contact
      @contact = Contact.find(params[:contact_id])
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]