app/controllers/addresses_controller.rb

UPDATE "addresses" SET "street" = $1, "updated_at" = $2 WHERE "addresses"."id" = $3  [["street", "MMMMarginal Cauã Bulhões"], ["updated_at", "2019-08-30 12:41:16.736125"], ["id", 100]]
---
  def update
    if @contact.address.update(address_params)

INSERT INTO "addresses" ("street", "city", "contact_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["street", "ABC Cauã Bulhões"], ["city", "Fortuna de Minas"], ["contact_id", 108], ["created_at", "2019-08-30 12:45:51.046565"], ["updated_at", "2019-08-30 12:45:51.046565"]]
---
  def create
    @contact.address = Address.new(address_params)

    if @contact.save

DELETE FROM "addresses" WHERE "addresses"."id" = $1  [["id", 104]]
---
  def destroy
    @contact.address.destroy

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 108], ["LIMIT", 1]]
---
  def set_contact
    @contact = Contact.find(params[:contact_id])