app/controllers/addresses_controller.rb

  def set_address
    @address = Contact.find(params[:contact_id]).address
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."contact_id" = $1 LIMIT $2  [["contact_id", 4], ["LIMIT", 1]]
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]