app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts"
SELECT  "contacts".* FROM "contacts" ORDER BY "contacts"."id" DESC LIMIT $1  [["LIMIT", 5]]
---
  def index
    if params[:version] == '1'
      @contacts = Contact.all
    elsif params[:version] == '2'
      @contacts = Contact.last(5)

INSERT INTO "contacts" ("name", "email", "birthdate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Shariksa Larson"], ["email", "harry@aufderharmohr.coaa"], ["birthdate", "1961-03-05"], ["created_at", "2019-08-28 20:18:22.704386"], ["updated_at", "2019-08-28 20:18:22.704386"]]
---
  def create
    @contact = Contact.new(contact_params)

    if @contact.save

UPDATE "contacts" SET "name" = $1, "updated_at" = $2 WHERE "contacts"."id" = $3  [["name", "xxxxxJuliana Bittencourt"], ["updated_at", "2019-08-29 13:35:01.522457"], ["id", 102]]
---
  def update
    if @contact.update(contact_params)

DELETE FROM "contacts" WHERE "contacts"."id" = $1  [["id", 107]]
---
  def destroy
    @contact.destroy

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_contact
      @contact = Contact.find(params[:id])