app/controllers/kinds_controller.rb

SELECT "kinds".* FROM "kinds"
---
  def index
    @kinds = Kind.all

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "kinds".* FROM "kinds" WHERE "kinds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_kind
      return @kind = Contact.find(params[:contact_id]).kind if params[:contact_id]