app/controllers/phones_controller.rb

SELECT "phones".* FROM "phones" WHERE "phones"."contact_id" = $1  [["contact_id", 10]]
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def set_phones
    @phones = Contact.find(params[:contact_id]).phones