app/controllers/phones_controller.rb

SELECT  "phones".* FROM "phones" WHERE "phones"."id" = $1 LIMIT $2  [["id", 207], ["LIMIT", 1]]
UPDATE "phones" SET "number" = $1, "updated_at" = $2 WHERE "phones"."id" = $3  [["number", "(53) xxxxx-5818"], ["updated_at", "2019-08-30 13:13:39.443252"], ["id", 207]]
---
  def update
    phone = Phone.find(phone_params[:id])

    if phone.update(phone_params)

INSERT INTO "phones" ("number", "contact_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["number", "(53) 123455-5818"], ["contact_id", 10], ["created_at", "2019-08-30 13:01:35.611436"], ["updated_at", "2019-08-30 13:01:35.611436"]]
---
  def create
    @contact.phones << Phone.new(phone_params)

SELECT  "phones".* FROM "phones" WHERE "phones"."id" = $1 LIMIT $2  [["id", 207], ["LIMIT", 1]]
DELETE FROM "phones" WHERE "phones"."id" = $1  [["id", 207]]
---
  def destroy
    phone = Phone.find(phone_params[:id])
    phone.destroy

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def set_contact
    @contact = Contact.find(params[:contact_id])